УправлениеСдачейКвартир/src/Enums/ВидДоговора/ВидДоговора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДоговора</name>
  <enumValues>
    <name>САрендодателем</name>
  </enumValues>
  <enumValues>
    <name>САрендатором</name>
  </enumValues>
</mdclass:Enum>

УправлениеСдачейКвартир/src/Documents/ЗаданияДляГоничной/ЗаданияДляГоничной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданияДляГоничной</name>
  <attributes>
    <name>Квартира</name>
    <type>
      <types>CatalogRef.Квартиры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУборки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНаУборку</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Горничная</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

УправлениеСдачейКвартир/src/Catalogs/Договоры/Договоры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договоры</name>
  <owners>Catalog.Клиенты</owners>
  <attributes>
    <name>Квартира</name>
    <type>
      <types>CatalogRef.Квартиры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидДоговора</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеСдачейКвартир/src/CommonModules/ОбменМобильноеПриложение/Module.bsl
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьДанныеОтвета(ИдентификаторКлиента, НомерПринятогоСообщения) Экспорт
	
	Попытка
		Возврат ПодготовитьОтвет(ИдентификаторКлиента, НомерПринятогоСообщения);
    Исключение
		ЗаписьЖурналаРегистрации("ОбменСМобильным.Ошибка", УровеньЖурналаРегистрации.Ошибка,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецФункции

Функция ПодготовитьОтвет(ИдентификаторКлиента, НомерПринятогоСообщения)
	
	Узел = ПланыОбмена.ОбменСМобильнымПриложением.НайтиПоКоду(ИдентификаторКлиента);
	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		УзелОбъект = ПланыОбмена.ОбменСМобильнымПриложением.СоздатьУзел();
		УзелОбъект.Код = ИдентификаторКлиента;
		УзелОбъект.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		УзелОбъект.Наименование = Строка(УзелОбъект.Пользователь);
		УзелОбъект.Записать();
		
		ПервичнаяРегистрация(УзелОбъект.Ссылка);
		
		Узел = УзелОбъект.Ссылка;
	КонецЕсли;
	
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(Узел, НомерПринятогоСообщения);
	
	ДанныеДляОтправки = Новый Массив;
	
	Пока ВыборкаИзменений.Следующий() Цикл
		
		Объект = ВыборкаИзменений.Получить();
		
		Если ТипЗнч(Объект) = Тип("СправочникОбъект.Квартиры") Тогда
			ОписаниеОбъекта = ОписаниеКвартиры(Объект);
		ИначеЕсли ТипЗнч(Объект) = Тип("СправочникОбъект.Договоры") Тогда
			ОписаниеОбъекта = ОписаниеДоговора(Объект);
		ИначеЕсли ТипЗнч(Объект) = Тип("СправочникОбъект.Клиенты") Тогда
			ОписаниеОбъекта = ОписаниеКлиента(Объект);
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаданияДляГоничной") Тогда
			ОписаниеОбъекта = ОписаниеЗадания(Объект);
		Иначе
			Продолжить;
		КонецЕсли;
		
		ДанныеДляОтправки.Добавить(ОписаниеОбъекта);
		
	КонецЦикла;
	
КонецФункции

Функция ОписаниеЗадания(Объект)
	Результат = Новый Структура;

	Результат.Вставить("Идентификатор", Строка(Объект.Ссылка.УникальныйИдентификатор()));
	Результат.Вставить("ДатаУборки", Объект.ДатаУборки);
	Результат.Вставить("ЗаданиеНаУборку", Объект.ЗаданиеНаУборку);
	Результат.Вставить("Квартира", Строка(Объект.Квартира.УникальныйИдентификатор()));
	
	Возврат Результат;
КонецФункции

Функция ОписаниеДоговора(Объект)
	
	Результат = Новый Структура;

	Результат.Вставить("Идентификатор", Строка(Объект.Ссылка.УникальныйИдентификатор()));
	Результат.Вставить("Наименование", Объект.Наименование);
	Результат.Вставить("Владелец", Строка(Объект.Владелец.УникальныйИдентификатор()));
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеКлиента(Объект)
	
	Результат = Новый Структура;

	Результат.Вставить("Идентификатор", Строка(Объект.Ссылка.УникальныйИдентификатор()));
	Результат.Вставить("Наименование", Объект.Наименование);
	Результат.Вставить("Телефон", Объект.Телефон);
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеКвартиры(Объект)
	
	Результат = Новый Структура;

	Результат.Вставить("Идентификатор", Строка(Объект.Ссылка.УникальныйИдентификатор()));
	Результат.Вставить("Наименование", Объект.Наименование);
	Результат.Вставить("КоличествоКомнат", Объект.КоличествоКомнат);
	
	Возврат Результат;	
	
КонецФункции

Процедура ПервичнаяРегистрация(Узел)
	
	ОбъектыДляРегистрации = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
		|	Квартиры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Квартиры КАК Квартиры
		|ГДЕ
		|	Квартиры.ЭтоГруппа = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектыДляРегистрации.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.Владелец КАК Клиент,
		|	Договоры.Ссылка КАК Договор
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|ГДЕ
		|	Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидДоговора.САрендатором)
		|ИТОГИ
		|ПО
		|	Владелец";
	
	ВыборкаКлиенты = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКлиенты.Следующий() Цикл
		ОбъектыДляРегистрации.Добавить(ВыборкаКлиенты.Клиент);
		ВыборкаДоговоры = ВыборкаКлиенты.Выбрать();
		Пока ВыборкаДоговоры.Следующий() Цикл
			ОбъектыДляРегистрации.Добавить(ВыборкаДоговоры.Договор);
		КонецЦикла;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданияДляГоничной.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаданияДляГоничной КАК ЗаданияДляГоничной";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектыДляРегистрации.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ОбъектыДляРегистрации) Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ОбъектыДляРегистрации);
	КонецЕсли;
	
КонецПроцедуры;

#КонецОбласти
